archivename
atheismresources
altatheismarchivename
resources
lastmodified
december
version
atheist
resources
addresses
atheist
organizations
usa
freedom
religion
foundation
darwin
fish
bumper
stickers
assorted
atheist
paraphernalia
freedom
religion
foundation
write
ffrf
box
madison
telephone
evolution
designs
evolution
designs
sell
darwin
fish
it's
fish
symbol
like
ones
christians
stick
cars
feet
word
darwin
written
inside
deluxe
moulded
plastic
fish
postpaid
write
evolution
designs
laurel
canyon
north
hollywood
people
san
francisco
bay
area
darwin
fish
lynn
gold
try
mailing
figmonetcomcom
net
people
who
lynn
directly
price
fish
american
atheist
press
aap
publish
atheist
books
critiques
bible
lists
biblical
contradictions
book
bible
handbook
ball
foote
american
atheist
press
isbn
edition
bible
contradictions
absurdities
atrocities
immoralities
contains
ball
foote
bible
contradicts
aap
based
king
james
version
bible
write
american
atheist
press
box
austin
cameron
road
austin
telephone
fax
prometheus
books
sell
books
including
haught's
holy
horrors
see
write
east
amherst
street
buffalo
new
york
telephone
alternate
address
may
newer
older
prometheus
books
glenn
drive
buffalo
africanamericans
humanism
organization
promoting
black
secular
humanism
uncovering
history
black
freethought
publish
quarterly
newsletter
aah
examiner
write
norm
allen
african
americans
humanism
box
buffalo
united
kingdom
rationalist
press
association
national
secular
society
islington
high
street
holloway
road
london
london
british
humanist
association
south
place
ethical
society
lamb's
conduit
passage
conway
hall
london
wcr
red
lion
square
london
wcr
fax
national
secular
society
publish
freethinker
monthly
magazine
founded
germany
ibka
internationaler
bund
der
konfessionslosen
und
atheisten
postfach
berlin
germany
ibka
publish
journal
miz
materialien
und
informationen
zur
zeit
politisches
journal
der
konfessionslosesn
und
atheisten
hrsg
ibka
mizvertrieb
postfach
berlin
germany
atheist
books
write
ibdk
internationaler
bucherdienst
der
konfessionslosen
postfach
hannover
germany
telephone
books
fiction
thomas
disch
santa
claus
compromise
short
story
ultimate
proof
santa
exists
characters
events
fictitious
similarity
living
dead
gods
well
walter
miller
canticle
leibowitz
gem
post
atomic
doomsday
novel
monks
who
spent
lives
copying
blueprints
saint
leibowitz
filling
sheets
paper
ink
leaving
white
lines
letters
edgar
pangborn
davy
post
atomic
doomsday
novel
set
clerical
states
church
example
forbids
produce
substance
containing
atoms
philip
dick
philip
dick
dick
wrote
philosophical
thoughtprovoking
short
stories
novels
stories
bizarre
times
approachable
wrote
mainly
wrote
people
truth
religion
technology
believed
met
sort
god
remained
sceptical
novels
following
relevance
galactic
pothealer
fallible
alien
deity
summons
group
earth
craftsmen
women
remote
planet
raise
giant
cathedral
oceans
deity
begins
demand
faith
earthers
pothealer
joe
fernwright
unable
comply
polished
ironic
amusing
novel
maze
death
noteworthy
description
technologybased
religion
valis
schizophrenic
hero
searches
hidden
mysteries
gnostic
christianity
reality
fired
brain
pink
laser
beam
unknown
possibly
divine
origin
accompanied
dogmatic
dismissively
atheist
friend
assorted
odd
characters
divine
invasion
god
invades
earth
making
young
woman
pregnant
returns
star
system
unfortunately
terminally
ill
assisted
dead
man
brain
wired
hour
easy
listening
music
margaret
atwood
handmaid's
tale
story
based
premise
congress
mysteriously
assassinated
fundamentalists
quickly
take
charge
nation
set
right
book
diary
woman's
life
tries
live
new
christian
theocracy
women's
right
property
revoked
bank
accounts
closed
sinful
luxuries
outlawed
radio
only
readings
bible
crimes
punished
retroactively
doctors
who
performed
legal
abortions
old
world
hunted
down
hanged
atwood's
writing
style
difficult
first
tale
grows
chilling
goes
authors
bible
dull
rambling
work
criticized
worth
reading
only
you'll
know
fuss
exists
versions
sure
true
version
books
nonfiction
peter
rosa
vicars
christ
bantam
press
rosa
christian
catholic
enlighting
history
papal
immoralities
adulteries
fallacies
german
translation
gottes
erste
diener
die
dunkle
seite
des
papsttums
droemerknaur
michael
martin
atheism
philosophical
justification
temple
university
press
philadelphia
usa
detailed
scholarly
justification
atheism
contains
outstanding
appendix
defining
terminology
usage
necessarily
tendentious
area
argues
negative
atheism
nonbelief
existence
gods
positive
atheism
belief
nonexistence
gods
includes
great
refutations
challenging
arguments
god
attention
paid
refuting
contempory
theists
platinga
swinburne
pages
isbn
hardcover
paperback
case
christianity
temple
university
press
comprehensive
critique
christianity
considers
best
contemporary
defences
christianity
ultimately
demonstrates
unsupportable
incoherent
pages
isbn
james
turner
god
creed
johns
hopkins
university
press
baltimore
usa
subtitled
origins
unbelief
america
examines
way
unbelief
agnostic
atheistic
mainstream
alternative
worldview
focusses
period
france
britain
emphasis
american
new
england
developments
religious
history
secularization
atheism
god
creed
intellectual
history
fate
single
idea
belief
god
exists
pages
isbn
hardcover
paper
george
seldes
editor
great
thoughts
ballantine
books
new
york
usa
dictionary
quotations
kind
concentrating
statements
writings
explicitly
implicitly
present
person's
philosophy
worldview
includes
obscure
suppressed
opinions
people
popular
observations
traces
way
people
expressed
twisted
idea
centuries
number
quotations
derived
cardiff's
great
men
think
religion
oyes
views
religion
pages
isbn
paper
richard
swinburne
existence
god
revised
edition
clarendon
paperbacks
oxford
book
second
volume
trilogy
began
coherence
theism
concluded
faith
reason
work
swinburne
attempts
construct
series
inductive
arguments
existence
god
arguments
tendentious
rely
imputation
late
century
western
christian
values
aesthetics
god
supposedly
simple
conceived
decisively
rejected
mackie's
miracle
theism
revised
edition
existence
god
swinburne
includes
appendix
makes
incoherent
attempt
rebut
mackie
mackie
miracle
theism
oxford
posthumous
volume
contains
comprehensive
review
principal
arguments
existence
god
ranges
classical
philosophical
positions
descartes
anselm
berkeley
hume
moral
arguments
newman
kant
sidgwick
recent
restatements
classical
theses
plantinga
swinburne
addresses
positions
push
concept
god
realm
rational
kierkegaard
kung
philips
well
replacements
god
lelie's
axiarchism
book
delight
read
formalistic
written
martin's
works
refreshingly
direct
compared
handwaving
swinburne
james
haught
holy
horrors
illustrated
history
religious
murder
madness
prometheus
books
looks
religious
persecution
ancient
times
present
day
only
christians
library
congress
catalog
card
number
norm
allen
african
american
humanism
anthology
see
listing
african
americans
humanism
gordon
stein
anthology
atheism
rationalism
prometheus
books
anthology
covering
wide
range
subjects
including
devil
evil
orality
history
reethought
comprehensive
bibliography
edmund
cohen
mind
biblebeliever
prometheus
books
study
people
christian
fundamentalists
effect
net
resources
there's
small
mailbased
archive
server
mantiscouk
carries
archives
old
altatheismmoderated
articles
assorted
files
mail
archiveservermantiscouk
saying
help
atheismindex
mail
back
reply
mathew
archivename
atheismintroduction
altatheismarchivename
introduction
lastmodified
april
version
begin
pgp
signed
message
introduction
atheism
mathew
mathewmantiscouk
article
attempts
general
introduction
atheism
tried
neutral
possible
contentious
issues
remember
document
represents
only
viewpoint
encourage
read
widely
draw
conclusions
relevant
books
listed
companion
article
sense
cohesion
progression
presented
article
imaginary
conversation
atheist
theist
questions
asked
imaginary
theist
questions
cropped
repeatedly
altatheism
newsgroup
created
frequently
asked
questions
answered
companion
article
note
article
arguably
slanted
answering
questions
posed
christian
viewpoint
faq
files
reflect
questions
actually
asked
predominantly
christians
who
proselytize
altatheism
talk
religion
talking
primarily
religions
christianity
judaism
islam
involve
sort
superhuman
divine
discussion
apply
religions
may
atheism
atheism
characterized
absence
belief
existence
god
atheists
believe
god
exist
referred
weak
atheist
position
strong
atheism
important
note
difference
positions
weak
atheism
simple
scepticism
disbelief
existence
god
strong
atheism
positive
belief
god
exist
fall
trap
assuming
atheists
strong
atheists
atheists
believe
nonexistence
gods
limit
atheism
specific
gods
christian
god
making
flatout
denials
isn't
disbelieving
god
believing
doesn't
exist
definitely
disbelief
proposition
means
believe
true
believing
true
equivalent
believing
false
may
simply
idea
true
brings
agnosticism
agnosticism
term
agnosticism
coined
professor
huxley
meeting
metaphysical
society
defined
agnostic
who
disclaimed
strong
atheism
believed
ultimate
origin
cause
unknown
unknowable
agnostic
who
believes
know
sure
god
exists
words
slippery
language
inexact
beware
assuming
work
someone's
philosophical
point
view
simply
calls
atheist
agnostic
example
people
agnosticism
mean
weak
atheism
word
atheism
only
referring
strong
atheism
beware
word
atheist
shades
meaning
difficult
generalize
atheists
say
sure
atheists
don't
believe
god
example
certainly
isn't
case
atheists
believe
science
best
way
find
universe
philosophical
justification
basis
atheism
philosophical
justifications
atheism
find
person
chooses
atheist
it's
best
ask
atheists
feel
idea
god
presented
major
religions
essentially
selfcontradictory
logically
impossible
god
exist
atheists
scepticism
see
evidence
god
exists
isn't
impossible
prove
nonexistence
counterexamples
statement
example
simple
prove
exist
prime
number
larger
prime
numbers
course
deals
welldefined
objects
obeying
welldefined
rules
gods
universes
similarly
welldefined
matter
debate
assuming
moment
existence
god
provably
impossible
still
subtle
reasons
assuming
nonexistence
god
assume
exist
possible
show
assumption
invalid
finding
single
counterexample
hand
assume
exist
question
provably
impossible
showing
assumption
invalid
may
require
exhaustive
search
possible
places
found
show
isn't
exhaustive
search
impractical
impossible
problem
largest
primes
prove
don't
exist
generally
accepted
assume
exist
evidence
theists
follow
rule
time
don't
believe
unicorns
can't
conclusively
prove
unicorns
exist
assume
god
exists
assumption
tested
exhaustive
search
god
prove
doesn't
exist
sceptical
atheist
assumes
default
god
exist
assumption
test
who
profess
strong
atheism
claim
sort
god
exists
generally
restrict
claims
cover
varieties
god
followers
religions
may
impossible
prove
conclusively
god
exists
may
possible
prove
say
god
religious
book
exist
may
possible
prove
god
presentday
religion
exists
practice
believing
god
religion
exists
close
believing
god
exists
sufficiently
counterarguments
based
impossibility
disproving
kind
god
applicable
god
essentially
nondetectable
god
interacts
universe
way
effects
interaction
measurable
interaction
universe
detectable
god
essentially
nondetectable
case
interact
universe
way
atheists
argue
god
interact
universe
importance
exists
bible
believed
god
easily
detectable
israelites
surely
still
detectable
today
note
demanding
god
interact
scientifically
verifiable
physical
way
surely
possible
perceive
effect
caused
presence
distinguish
don't
exist
may
think
there's
philosophical
justification
atheism
isn't
still
religious
belief
common
pastimes
philosophical
discussion
redefinition
game
cynical
view
game
follows
person
begins
making
contentious
statement
person
points
can't
true
person
gradually
redefines
words
statement
arrives
person
prepared
accept
records
statement
person
agreed
continues
eventually
uses
statement
agreed
uses
original
definitions
words
obscure
redefinitions
originally
needed
agree
seen
apparently
inconsistent
tend
play
point
digression
answer
question
isn't
atheism
religious
belief
depends
crucially
meant
religious
religion
generally
characterized
belief
superhuman
controlling
power
especially
sort
god
faith
worship
it's
worth
pointing
passing
varieties
buddhism
religion
according
definition
atheism
certainly
belief
sort
superhuman
power
categorized
worship
meaningful
sense
widening
definition
religious
encompass
atheism
tends
result
aspects
human
behaviour
suddenly
classed
religious
well
science
politics
watching
it's
religion
surely
belief
atheism
science
still
just
act
faith
like
religion
firstly
it's
entirely
clear
sceptical
atheism
actually
believes
secondly
adopt
number
core
beliefs
assumptions
sort
sense
sensory
data
experience
atheists
try
adopt
core
beliefs
possible
subject
questioning
experience
throws
doubt
science
number
core
assumptions
example
generally
assumed
laws
physics
observers
sort
core
assumptions
atheists
basic
ideas
called
acts
faith
know
based
acts
faith
term
loses
meaning
faith
refer
complete
belief
according
definition
atheism
science
certainly
acts
faith
course
individual
atheists
scientists
dogmatic
religious
followers
claiming
general
tendency
atheists
who
reluctant
state
certainty
universe
exists
faith
refer
belief
supporting
evidence
proof
sceptical
atheism
certainly
doesn't
fit
definition
sceptical
atheism
beliefs
strong
atheism
closer
still
doesn't
match
dogmatic
atheist
tend
refer
experimental
data
lack
asserting
god
exist
atheism
religious
surely
it's
antireligious
unfortunate
human
tendency
label
friend
enemy
truth
clearcut
atheism
position
runs
logically
counter
theism
sense
antireligion
religious
believers
speak
atheists
antireligious
mean
atheists
sort
antipathy
hatred
theists
categorization
atheists
hostile
religion
unfair
atheist
attitudes
theists
cover
broad
spectrum
atheists
take
live
let
live
attitude
questioned
mention
atheism
close
friends
course
may
part
atheism
socially
acceptable
countries
atheists
antireligious
may
try
convert
possible
historically
antireligious
atheists
made
little
impact
society
eastern
bloc
countries
digress
slightly
soviet
union
originally
dedicated
separation
church
state
just
like
usa
soviet
citizens
legally
free
worship
wished
institution
state
atheism
came
stalin
took
control
soviet
union
tried
destroy
churches
order
gain
complete
power
population
atheists
vocal
beliefs
only
see
religion
encroaching
matters
business
example
government
usa
individuals
concerned
church
state
remain
separate
don't
allow
religion
say
running
state
surely
that's
state
atheism
principle
separation
church
state
state
legislate
matters
religious
belief
means
only
state
promote
religion
expense
promote
belief
religious
nature
religions
still
say
discussion
purely
secular
matters
example
religious
believers
historically
responsible
encouraging
political
reforms
today
organizations
campaigning
increase
spending
foreign
founded
religious
campaigns
long
campaign
secular
matters
long
discriminate
religious
grounds
atheists
happy
see
say
prayer
schools
there's
god
care
people
pray
people
who
pray
voters
lawmakers
tend
who
don't
pray
can't
just
ignore
christian
prayer
schools
intimidating
nonchristians
told
need
join
diversity
religious
nonreligious
belief
means
impossible
formulate
meaningful
prayer
acceptable
present
public
event
nonprayers
tend
friends
family
who
pray
reasonable
care
friends
family
wasting
time
motives
mentioned
christians
who
campaign
increased
foreign
atheists
aren't
atheist
charities
hospitals
don't
atheists
object
religious
charities
charities
religious
purpose
atheists
contribute
atheists
contribute
religious
charities
well
sake
practical
atheists
voluntary
work
charities
founded
theistic
basis
atheists
feel
atheism
isn't
worth
shouting
connection
charity
atheism
just
simple
obvious
everyday
matter
charity
feel
it's
cheap
say
selfrighteous
simple
charity
excuse
plug
set
religious
beliefs
weak
atheists
building
hospital
say
believe
god
strange
idea
it's
like
holding
party
say
today
birthday
fuss
atheism
rarely
evangelical
atheism
isn't
antireligious
backlash
one's
upbringing
way
rebelling
people
parents
who
attempt
force
religious
atheist
ideas
people
choose
call
atheists
it's
doubtless
case
religious
people
chose
religion
backlash
atheist
upbringing
way
hand
people
choose
religion
way
conforming
expectations
whole
can't
conclude
atheism
religion
backlash
conformism
general
people
tendency
group
act
think
independently
atheists
differ
religious
people
don't
believe
god
that's
atheists
may
listen
heavy
metal
backwards
may
prefer
verdi
requiem
know
words
may
wear
hawaiian
shirts
may
dress
black
may
wear
orange
robes
buddhists
lack
belief
sort
god
atheists
carry
copy
bible
arguing
course
chances
met
atheists
realising
atheists
unexceptional
behaviour
appearance
unexceptional
aren't
atheists
moral
religious
people
depends
define
morality
obedience
god
course
atheists
moral
don't
obey
god
talks
morality
talks
acceptable
right
unacceptable
wrong
behaviour
society
humans
social
animals
maximally
successful
cooperate
reason
discourage
atheists
antisocial
immoral
behaviour
purely
purposes
selfpreservation
atheists
behave
moral
compassionate
way
simply
feel
natural
tendency
empathize
humans
care
happens
don't
know
simply
way
naturally
people
who
behave
immorally
try
atheism
justify
actions
equally
people
who
behave
immorally
try
religious
beliefs
justify
actions
example
here
trustworthy
saying
deserves
full
acceptance
jesus
christ
came
world
save
sinners
reason
shown
mercy
jesus
christ
display
unlimited
patience
example
who
believe
receive
eternal
life
now
king
eternal
immortal
invisible
only
god
honor
glory
quote
statement
made
court
february
jeffrey
dahmer
notorious
cannibal
serial
killer
milwaukee
wisconsin
atheist
massmurderer
religious
massmurderer
trivial
morality
survey
conducted
roper
organization
found
behavior
deteriorated
born
experiences
only
respondents
driven
intoxicated
born
conversion
similarly
illegal
drugs
conversion
percent
admitted
engaging
illicit
sex
salvation
freethought
today
september
best
religion
monopoly
moral
behaviour
atheist
morality
mean
morality
atheists
answer
yes
explained
atheists
ideas
morality
least
strong
held
religious
people
mean
atheism
characteristic
moral
answer
atheism
imply
person
behave
atheists
follow
moral
rules
theists
reasons
atheists
view
morality
created
humans
according
way
humans
feel
world
work
seeing
set
rules
decreed
supernatural
aren't
atheists
just
theists
who
denying
god
study
freedom
religion
foundation
found
atheists
who
responded
atheists
religion
work
found
religious
beliefs
fundamentally
incompatible
observed
atheists
unbelievers
ignorance
denial
unbelievers
choice
vast
majority
spent
time
studying
religions
great
depth
made
careful
considered
decision
reject
religious
beliefs
decision
may
course
inevitable
consequence
individual's
personality
naturally
sceptical
person
choice
atheism
only
makes
sense
only
choice
person
honestly
don't
atheists
believe
god
atheists
live
lives
watching
desire
watched
matter
goodnatured
big
brother
figure
atheists
like
able
believe
god
believe
merely
wants
true
risks
approach
obvious
atheists
decide
wanting
believe
evidence
belief
course
atheists
see
evidence
existence
god
unwilling
souls
see
atheists
previously
religious
explained
vast
majority
seriously
considered
possibility
god
exists
atheists
spent
time
prayer
trying
reach
god
course
true
atheists
lack
open
mind
assuming
atheists
biased
insincere
offensive
closedminded
comments
course
god
just
aren't
looking
properly
likely
viewed
patronizing
certainly
wish
engage
philosophical
debate
atheists
vital
give
benefit
doubt
assume
sincere
say
searched
god
willing
believe
basically
telling
truth
debate
futile
isn't
whole
life
completely
pointless
atheist
atheists
live
purposeful
life
decide
think
gives
meaning
life
pursue
goals
try
lives
count
wishing
eternal
life
influence
people
who
live
example
atheist
may
dedicate
life
political
reform
hope
leaving
mark
history
natural
human
tendency
look
meaning
purpose
random
events
means
obvious
life
sort
meaning
put
way
looks
like
question
actually
sensible
ask
atheists
believe
asking
meaning
life
silly
asking
meaning
cup
coffee
believe
life
purpose
meaning
just
atheists
find
comfort
time
danger
ways
obtaining
comfort
family
friends
pets
spiritual
level
food
drink
may
sound
empty
vulnerable
way
face
danger
individuals
believe
comforting
face
reality
matter
harsh
end
it's
decision
individual
concerned
atheists
unable
believe
believe
merely
makes
feel
comfortable
put
truth
comfort
consider
searching
truth
makes
feel
unhappy
that's
just
hard
luck
don't
atheists
worry
suddenly
shown
wrong
short
answer
atheists
atheists
years
encountered
arguments
supposed
evidence
existence
god
found
invalid
inconclusive
thousands
years
religious
belief
haven't
resulted
proof
existence
god
atheists
tend
feel
unlikely
proved
wrong
future
worrying
theists
question
beliefs
don't
arguments
apply
beliefs
questioned
similar
weak
atheism
sceptical
default
position
take
asserts
strong
atheism
negative
belief
theism
strong
positive
belief
atheists
argue
theists
question
beliefs
real
harm
cause
just
believers
sort
harm
religion
represents
huge
financial
work
burden
mankind
it's
just
matter
religious
believers
wasting
money
church
buildings
think
time
effort
spent
building
churches
praying
imagine
effort
spent
theists
believe
miracle
healing
instances
ill
people
healed
priest
ceasing
take
medicines
prescribed
doctors
dying
result
theists
died
refused
blood
transfusions
religious
grounds
arguable
catholic
church's
opposition
birth
control
condoms
increasing
problem
overpopulation
thirdworld
countries
contributing
spread
aids
worldwide
religious
believers
known
murder
children
allow
children
atheists
marry
religion
weren't
real
believers
just
claimed
believers
sort
excuse
makes
real
believer
true
religions
it's
hard
tell
look
christianity
competing
groups
convinced
only
true
christians
fight
kill
atheist
supposed
decide
who's
real
christian
who
isn't
major
christian
churches
like
catholic
church
church
england
can't
decide
end
atheists
take
pragmatic
view
decide
who
calls
christian
uses
christian
belief
dogma
justify
actions
considered
christian
maybe
christians
just
perverting
christian
teaching
ends
surely
bible
readily
support
unchristian
acts
can't
moral
bible
word
god
couldn't
made
easy
misinterpret
know
beliefs
aren't
perversion
god
intended
single
unambiguous
interpretation
bible
atheist
take
interpretation
just
sayso
sorry
claims
believes
jesus
murdered
jesus
bible
told
call
christian
obviously
extreme
sorts
beliefs
questioned
proved
god
exist
unlikely
basic
religious
beliefs
shared
faiths
nonsense
hold
pointed
start
dialogue
positive
assertions
existence
entities
inherently
harder
disprove
negative
ones
proved
unicorns
don't
exist
doesn't
unlikely
myths
valid
hold
negative
assertion
default
hold
positive
assertion
default
course
weak
atheists
argue
asserting
still
well
atheism's
great
theists
unfortunately
popularity
belief
little
correct
works
consider
people
believe
astrology
graphology
pseudosciences
atheists
feel
simply
human
weakness
believe
gods
certainly
primitive
human
societies
religion
allows
people
deal
phenomena
adequately
understand
course
there's
religion
industrialized
world
find
people
believing
religious
explanations
phenomena
perfectly
adequate
natural
explanations
religion
may
started
means
attempting
explain
world
nowadays
serves
purposes
well
cultures
developed
religions
surely
say
religions
only
superficially
similar
example
it's
worth
remembering
religions
buddhism
taoism
lack
sort
concept
god
christian
sense
course
religions
quick
denounce
competing
religions
it's
odd
religion
try
justify
famous
scientists
philosophers
who
concluded
god
exists
scientist
philosopher
who
believes
god
who
pointed
truth
belief
determined
people
believe
important
realize
atheists
view
famous
scientists
philosophers
way
theists
view
religious
leaders
famous
scientist
only
human
may
expert
fields
talks
matters
words
carry
special
weight
respected
scientists
made
look
foolish
speaking
subjects
lie
fields
expertise
saying
widespread
belief
religion
entirely
certainly
religion
question
properties
helped
spread
far
theory
memetics
talks
memes
sets
ideas
propagate
human
minds
analogy
genes
atheists
view
religions
sets
successful
parasitic
memes
spread
encouraging
hosts
convert
memes
avoid
destruction
discouraging
believers
questioning
doctrine
using
peer
pressure
keep
onetime
believers
admitting
mistaken
religious
memes
encourage
hosts
destroy
hosts
controlled
memes
course
memetic
view
virtue
associated
successful
propagation
meme
religion
number
people
who
believe
disease
number
people
who
caught
religion
entirely
true
least
puts
across
important
messages
fundamental
messages
atheism
important
ideas
atheists
promote
following
just
don't
surprised
see
ideas
present
religions
moral
behaviour
mindlessly
following
rules
especially
sceptical
positive
claims
life
sort
meaning
it's
find
search
true
makes
uncomfortable
life
it's
only
you'll
it's
relying
external
power
change
change
just
something's
popular
doesn't
mean
it's
assume
assume
it's
easy
test
don't
believe
just
true
finally
importantly
beliefs
open
question
thanks
taking
time
read
article
mathew
begin
pgp
signature
version
iqcvagubkajrxzxnvroblfaqfsbwpmhepyggemowpsivxkhyyxmerfao
ltvtmvtunzsbbpwqkbjarbyssznfhtdiirsseyplrbvokeq
nihqnzxepgvlttlezeoehzjxlefrdeypvaytyqqgbharboehdcrteatmp
qzhssppau
end
pgp
signature
pgp
mail
pgpinfomantiscouk
article
mimsyumdedu
mangoecsumdedu
charley
wingate
writes
well
john
necessarily
elaborated
theology
evidence
known
luke
content
known
canonized
form
new
argument
elaborate
little
argument
goes
follows
qoid
quotes
john
codified
way
matthew
luke
considered
similar
point
knowledge
entirely
source
assuming
knew
luke
obviously
put
luke
give
evidence
assumption
don't
think
follows
take
traditional
attributions
luke
known
john
john
elder
figure
case
we're
talking
spans
time
here
well
range
lifetimes
talking
date
texts
here
age
authors
usual
explanation
time
order
mark
matthew
luke
consider
respective
ages
says
matthew
read
text
mark
luke
matthew
mark
assumed
john
knew
content
luke's
text
evidence
overwhelming
admittedly
earlier
manuscripts
john
discovered
interesting
dated
old
unfortunately
haven't
hand
think
late
early
possibly
old
shed
doubt
order
putting
john
rest
don't
see
point
exactly
james
felder
first
hand
knowledge
events
obvious
least
older
texts
base
account
association
luke
paul
mark
peter
generally
accepted
well
genuine
letter
peter
close
wouldn't
sure
original
card
sender
receiver
fine
what's
supposed
say
missing
don't
think
step
removed
source
bad
luke
mark
matthew
learned
stories
directly
diciples
believe
sort
big
transformation
jesus
gospel
people
posit
news
reports
generally
john
diciple
there's
john
disciple
generally
accepted
style
language
theology
counterargument
argument
john
disciple
relies
claim
gospel
john
evidence
step
generation
removed
bad
times
compare
reports
similar
events
century
illiterate
societies
speak
believers
necessarily
best
sources
obvious
mark
edited
old
oldest
manuscripts
knowledge
antiquated
oldest
estimates
complete
only
clear
editing
problem
ending
it's
basically
hopeless
mess
oldest
versions
give
strong
sense
incompleteness
point
shortest
versions
break
midsentence
obvious
solution
point
part
text
lost
material
verse
pretty
clearly
later
represent
synopsys
end
luke
words
know
original
mark
look
like
arguments
based
mark
pretty
weak
connected
redating
john
benedikt
dmnkeplerunhedu
kings
philosophers
philosophers
kings
writes
recently
ras
ordered
resisted
cared
apparently
post
religious
flyer
entitled
soul
scroll
thoughts
religion
spirituality
matters
soul
inside
bathroom
stall
doors
school
university
new
hampshire
sort
newsletter
assembled
hall
director
campus
poses
question
spirituality
issue
solicits
responses
included
next
issue
it's
pretty
vague
assume
it's
put
christian
they're
careful
mention
jesus
bible
i've
heard
defend
saying
well
doesn't
support
religion
state
university
strong
supporter
separation
church
state
enraged
sounds
like
it's
just
screaming
parody
give
copy
friendly
neighbourhood
subgenius
preacher
luck
he'll
run
mental
mincer
hand
back
outrageously
offensive
gutbustingly
funny
parody
paste
originals
see
now
stool
scroll
thoughts
religion
spirituality
matters
colon
text
wipe
mathew
article
nhyaprharderccrpidaorg
nhyharderccrpidaorg
bob
mcgwier
writes
hate
economic
terrorism
political
correctness
worse
hate
policy
effective
approach
donating
organizating
directly
indirectly
supports
gay
rights
issues
end
boycott
funding
scouts
reconcile
apparent
contradiction
rob
strom
stromwatsonibmcom
ibm
research
saw
mill
river
road
box
yorktown
heights
article
aprbatmanbmdtrwcom
jbrownbatmanbmdtrwcom
writes
didn't
say
lucifer
created
perfect
nature
yes
define
perfect
think
playing
usual
game
here
sweeping
statements
like
omni
holy
perfect
don't
note
mean
exactly
say
says
terms
leads
contradictions
i'm
trying
play
games
here
understand
way
especially
coming
completely
point
view
atheism
take
foot
mouth
wondered
catholic
christian
contradiction
unresolvable
reasons
atheist
believe
believed
similar
sentences
long
time
shows
power
religion
claims
now
god
prevented
lucifer's
fall
taking
away
ability
choose
moral
alternatives
worship
god
worship
mean
god
error
lucifer
free
first
place
exactly
god
allows
evil
evil
now
that's
opinion
best
premise
point
view
premise
true
specifically
evil
allow
evil
occur
follows
definition
evil
ordinarily
letting
evil
happen
allowing
evil
take
place
place
causing
evil
evil
give
definition
free
especially
presence
omniscient
selfdetermination
words
god
created
conscious
beings
who
ability
choose
moral
choices
independently
god
free
omniscient
attribute
god
know
creatures
omnipotent
created
choice
left
known
course
events
fixed
omniscient
extend
argument
james
tims
god
omniscient
clearly
creating
beings
free
moral
choice
greater
emergence
ungodliness
evilsin
created
knowing
outcome
advance
greater
allow
evil
knowledge
happen
unipolar
system
possibility
necessarily
imply
evil
logically
possible
god
know
logically
possible
god
restrains
free
being's
choice
choose
evil
simply
truly
free
moral
choice
defined
loving
obeying
god
avoiding
behaviors
god
prohibits
say
who
evil
well
like
sure
evil
logically
possible
omnipotent
free
choices
scenario
gives
define
free
imagine
following
beings
harm
easily
implemented
making
appreciate
object
deeds
don't
long
feel
absence
evil
case
arguing
conceivable
omnipotent
omnipotent
logically
consistent
well
give
pet
idea
omnipotent
first
deletion
weak
way
just
speculating
ubiquitous
pink
unicorns
basis
speculation
idea
god
didn't
just
fall
blue
reading
science
fiction
fantasy
know
disagree
bible
god
who
omniscient
created
beings
free
moral
choice
definitional
logic
follows
that's
least
mind
amount
evidence
god
exists
biblical
description
may
fair
evidence
bolsters
argument
view
bible
omniscient
omnipotent
god
destroys
credibility
bible
people
interested
evidence
god
unfortunately
can't
definitions
benedikt
arromdeejyusenkyoucsjhuedu
ken
arromdee
writes
motto
originated
starspangled
banner
tell
atheists
motto
oncoins
originated
mccarthyite
smear
equated
atheism
communism
called
unamerican
didn't
motto
coins
civil
war
just
required
currency
keith
article
buedu
jaegerbuphybuedu
gregg
jaeger
writes
victimized
muslims
victimize
true
muslims
muslims
annoying
don't
understand
point
petty
sarcasm
basic
principle
islam
born
muslim
says
testify
god
god
mohammad
prophet
god
long
explicitly
reject
islam
word
considered
muslim
muslims
phenomenon
you're
attempting
general
rule
psychology
direct
odds
basic
islamic
principles
attack
islam
argue
islam
explicitly
contradicts
criticism
islam
change
criticism
arguments
namely
people
identify
muslims
victims
attacks
argument
bad
situation
muslims
deeds
muslim
victimize
named
count
argument
people
true
muslims
mention
made
muslims
cause
bad
situation
party
double
standards
benedikt
reference
line
trimmed
liveseysolntzewpdsgicom
jon
livesey
writes
deal
confusion
here
started
assertion
objective
morality
admit
here
finished
recursive
definition
murder
objectively
immoral
eactly
murder
requires
appeal
morality
yes
now
switch
targets
little
only
little
now
asking
goal
mean
goal
suggesting
objective
goal
form
morals
achieve
well
example
goal
natural
morality
survival
propogation
species
example
moral
system
presented
declaration
independence
states
guaranteed
life
liberty
pursuit
happiness
see
moral
system
define
purpose
system
moral
end
murder
certainly
violation
golden
rule
thought
defined
murder
intentional
killing
nonmurderer
responded
asking
execution
innocent
person
system
capital
punishment
murder
fail
see
claimed
system
morality
objective
thought
first
claim
kind
objective
morality
example
murder
wrong
don't
claim
that's
fine
well
murder
violates
golen
rule
certainly
pillar
moral
system
assuming
current
system
manner
implementation
objectively
moral
think
approximation
can't
perfect
way
don't
understand
difference
arbitrary
objective
keith
schneider
defines
murder
that's
arbitrary
jon
livesey
may
still
say
well
according
personal
system
morality
killing
humans
murder
wrong
legal
definition
murder
may
usa
kuweit
saudi
arabia
prc
may
matters
whit
well
objective
assume
system
based
clear
fundamental
concepts
arbitary
implies
clear
line
reasoning
keith
kmrpocwruedu
keith
ryan
writes
people
keep
asking
questions
rarely
answer
nope
i've
answered
question
posed
answered
multiple
times
keith
liveseysolntzewpdsgicom
jon
livesey
writes
long
motto
stay
default
where's
cutoff
point
don't
know
exact
cutoff
least
years
surely
years
notion
default
take
account
changes
population
makeup
specifically
changes
talking
arguing
motto
interpreted
offensive
larger
portion
population
now
years
ago
keith
sandviknewtonapplecom
kent
sandvik
writes
borrow
philosophy
don't
truly
understand
color
red
seen
true
experienced
color
red
still
interpretation
wouldn't
know
red
certainly
couldn't
judge
subjectively
objectivity
applicable
wanting
discuss
merits
red
keith
wpratlantadgcom
bill
rawlins
writes
patently
untrue
demonstrated
nauseum
complexity
life
contradiction
second
law
point
order
come
disorder
freze
water
you've
created
ordered
crystal
disordered
liquid
entropy
increased
locally
order
increased
creation
dna
random
processes
incalculably
remote
find
idea
god
likely
apply
anthropic
principle
circumvent
probablilty
problems
keith
arromdeejyusenkyoucsjhuedu
ken
arromdee
writes
discuss
merits
racism
psycholgical
benefits
well
experienced
personally
speak
experiencing
religion
mean
believe
religion
that's
right
pretty
impossible
right
ideal
believe
just
try
religion
only
determine
course
thought
suits
best
possible
religion
warrants
belief
belief
carries
psychological
benefits
psychological
burdens
speak
experiencing
racism
mean
believe
racism
racist
parallelism
meant
odd
usage
phrase
well
psychological
benefits
gained
racism
only
fully
understood
judged
persons
actually
believing
racism
course
parallel
happens
poor
originated
keith
bobbeviceicotekcom
robert
beauchaine
writes
don't
know
capital
punishment
wrong
isn't
shooting
analogy
continue
drive
car
realizing
sooner
later
going
killed
automobile
accident
know
people
killed
result
driving
continue
anyway
know
killing
i'm
sure
i'd
drive
car
sufficient
evidence
conclude
necessarily
kill
lifetime
yes
thinks
thinks
going
cause
involved
fatal
accident
likelihood
surprisingly
high
just
man
firing
squad
gun
shooting
blanks
mean
guilty
don't
know
jon
say
taking
human
life
murder
say
murder
wrong
situation
only
action
prevent
murder
mean
killing
wrong
situtation
note
situation
occur
options
thank
killing
don't
just
say
killing
wrong
basically
saying
i'm
bit
tired
probabilistic
arguments
attempting
condescending
system
works
pretty
well
small
consolation
poor
innocent
bastard
lethal
injection
personal
value
human
life
based
solely
statistical
approach
sound
like
unswerving
adherent
needs
outweighing
needs
fuck
people
found
risk
acceptable
likely
die
plane
crash
using
electric
blender
executed
innocent
personally
think
risk
acceptable
ideal
moral
system
risk
acceptable
acceptable
fudge
factor
approximation
ideal
keith
bobbeviceicotekcom
robert
beauchaine
writes
think
people
approve
death
penalty
realizing
shortcomings
doesn't
reasonable
sole
judge
reasonability
revenge
merits
find
capital
punishment
talking
majority
people
support
anyway
think
revenge
fairness
people
favor
punishment
murderer
going
punished
people
think
deserves
people
wouldn't
think
fair
murderer
live
victim
died
revenge
petty
pathetic
think
petty
pathetic
views
minority
local
televised
hot
topic
talk
show
recently
segment
capital
punishment
advocate
portion
system
jurisprudence
cited
reason
supporting
bastard
deserved
true
human
compassion
forgiveness
sympathy
required
compassion
forgiveness
sympathy
wrongs
take
great
lengths
sure
advantage
removed
similar
situation
forced
kills
apply
golden
rule
kill
person
turn
entire
moral
system
based
concept
stating
human
life
sacred
violated
sound
like
sort
religious
view
mean
reasonable
imprisonment
think
sure
person
released
found
innocent
still
can't
undo
imiprisonment
served
shouldn't
imprision
people
watch
closely
cost
similar
especially
just
implanted
sort
electronic
device
alive
prison
dead
chair
once
criminal
committed
murder
desires
irrelevant
still
answered
question
concerned
death
penalty
due
possibility
execution
innocent
isn't
concern
shared
imprisonment
shouldn't
logic
administer
minimum
punishment
possible
avoid
violating
liberty
happiness
innocent
person
keith
bobbeviceicotekcom
robert
beauchaine
writes
kill
person
innocent
person
convicted
murder
murder
committed
murderer
least
wouldn't
reasonably
considered
murderer
reasonable
introduced
fudge
factor
account
inability
totally
objective
due
lack
absolutely
true
society
collective
decides
carry
burden
executing
it's
citizens
carries
blame
innocent
blood
voter
who
casts
ballot
favor
capital
punishment
part
guilty
murder
innocent
victim
system
only
people
favor
system
blame
society
accepts
system
member
society
blame
innocent
person
executed
favor
work
convince
members
society
accepted
blamethey've
considered
risk
acceptable
similarly
person
who
drives
accept
blame
fatal
traffic
accidents
surely
going
happen
people
driving
question
risk
acceptable
likely
innocent
person
killed
driving
executed
keith
article
ppsilinkcom
ppsilinkcom
james
tims
writes
maintaining
classes
prison
place
innocent
people
higher
risk
unjust
death
state
executed
classes
occasional
error
answer
position
place
people
prison
life
depends
only
predisposition
murder
success
rate
escape
ability
commit
crimes
words
lifetime
imprisonment
doesn't
work
it's
we're
executing
people
we're
careful
lock
bob
beauchaine
bobbeviceicotekcom
queens
stay
blew
bronx
away
sank
manhattan
sea
article
aprmonuccmonasheduau
dariceyoyoccmonasheduau
fred
rice
writes
propose
trends
greater
level
general
depression
society
psychological
problems
greater
sexual
promiscuity
linked
prime
cause
evidence
stage
whole
thesis
reasonable
request
people
ponder
damn
right
can't
evidence
rarely
widespread
social
phenomenon
reducible
simple
premise
psychology
hard
science
roughly
mathematical
soundness
physics
premise
may
well
right
likely
reflects
socialization
religious
background
well
need
validate
religious
beliefs
pretend
answers
don't
say
xenophobia
guilt
intolerance
brought
adherence
fundamentalist
religions
play
just
large
role
depressing
members
society
mileage
obviously
varies
bob
beauchaine
bobbeviceicotekcom
queens
stay
blew
bronx
away
sank
manhattan
sea
article
aprblazecsjhuedu
arromdeejyusenkyoucsjhuedu
ken
arromdee
writes
article
pjbsdjfidoasdsgicom
liveseysolntzewpdsgicom
jon
livesey
writes
say
innocent
person
killed
sense
bad
certainly
feel
way
punish
single
murder
now
reform
system
reducing
number
deaths
produce
system
i'd
say
back
system
reintroduce
only
single
extra
death
bob
think
bad
sense
stronger
yes
argument
sole
purpose
death
penalty
kill
people
it's
primary
argue
only
purpose
continue
kill
people
practice
utility
especially
know
killing
innocents
unconscionable
least
existence
prison
system
transportation
system
based
merits
society
detriments
willing
accept
lost
innocent
lives
overwhelming
benefit
continued
existence
systems
stretch
evidence
arguments
claim
capital
punishment
just
case
wasn't
clear
maintain
capital
punsihment
system
kills
innocent
people
net
positive
gain
pin
corner
ask
respond
don't
belief
state
right
take
life
won't
open
debate
tiring
thread
anyway
bob
beauchaine
bobbeviceicotekcom
queens
stay
blew
bronx
away
sank
manhattan
sea
article
phnkoinnbkctronnewsctroncom
kingctroncom
john
king
writes
adpeterssunflowerbioindianaedu
andy
peters
writes
funny
there's
absolutely
numbers
supporting
jack's
implication
probability
protean
molecule
forming
recall
figure
just
molecules
forming
lists
steps
determining
probability
abiogenesis
going
take
little
time
andy
hope
you'll
patient
just
understand
coming
theist
don't
totally
reject
possibility
complex
creation
just
come
assume
equally
objective
discussions
net
little
recent
years
theists
doctrinal
issues
rarely
ventured
origins
arena
speculation
involved
hard
data
dna
program
proper
sequences
tells
cells
divide
form
tells
designer
nonetheless
remain
open
minded
wonder
claim
net
exactly
type
talking
creationist
makes
completely
unsupported
statement
heshe
completely
ignorant
taken
task
finally
replies
subtle
insult
actually
insults
just
sure
fair
let's
check
details
jack
don't
know
abiogenesis
sin
know
next
mean
probability
wrong
first
post
speculation
involved
isn't
biology
know
abiogenesis
classes
past
high
school
read
chris
colby's
faq
paleontology
geology
know
speculating
speculative
basis
imply
keep
open
mind
allow
earth
universe
creatures
created
years
ago
intended
flame
say
don't
know
subject
calling
idiot
don't
know
areas
calling
question
mainstream
science
words
calling
speculative
mean
physics
chemistry
speculative
sense
may
implying
rejection
creationism
sign
closemindedness
theory
evolution
especially
speculative
case
merely
misinterpreted
case
worst
accused
unclear
prose
jack
scott
smullinsecnpurdueedu
writes
found
list
biblical
contradictions
cleaned
bit
now
i'd
like
help
i'm
curious
know
purpose
people
think
lists
serve
lists
like
value
quantity
quality
argument
article
length
list
here
poorer
quality
quotes
taken
online
bible
doubt
problem
verses
quoted
inaccurately
isn't
problem
here
i've
known
fundamentalists
life
who
denied
errors
transmission
contradictions
here
solomon
horse
stalls
verse
just
sort
contradiction
fundies
don't
problem
experience
sorts
contradictions
amount
attacking
straw
man
just
silly
rely
taking
quotes
context
reasonable
explanations
ones
genuine
contradictions
need
given
here
least
effort
made
understand
respond
common
replies
given
fundies
look
example
research
dave
butler
put
article
examining
false
prophecy
tyre
excellent
start
antiinerrancy
list
teeth
wellresearched
documented
contradiction
worth
hundred
quotes
taken
context
thrown
list
lists
like
just
toss
bunch
quotes
bible
verse
salad
just
don't
cut
who
argue
inerrancy
find
sort
embarassing
fundies
find
josh
mcdowell
find
material
ftprutgersedu
pubsocreligionchristianotherscontradictions
quality
uneven
sides
argument
just
compilation
people
written
useful
antiinerrancy
faq
exams
willing
help
put
article
baedrportersuvmsyredu
drportersuvmsyredu
brad
porter
writes
science
wonderful
answering
questions
i'm
type
question
scientific
findings
personally
find
theory
evolution
unfathomable
humans
highly
evolved
complex
organism
thinks
learns
develops
truly
organism
resulted
random
genetic
mutations
natural
selection
stuff
deleted
computers
excellent
exampleof
evolution
creator
create
computers
create
sand
goes
silicon
goes
integrated
circuits
processor
board
took
put
interesting
way
just
like
plants
create
oxygen
using
light
photosynthesis
it's
bigger
leap
talk
created
find
unfathomable
resort
believing
creator
simpler
alternative
exists
simply
incapable
understanding
beginnings
beginnings
that's
present
keeps
perfectly
busy
jim
halat
article
jlrpiedu
johnsdjecitsrpiedu
dan
johnson
writes
article
iomainemaineedu
iomainemaineedu
writes
dan
johnson
don't
know
take
hand
anyway
bravo
gods
beautiful
simply
beautiful
jim
halat
article
wrusnewswwmantiscouk
mathew
mathewmantiscouk
writes
nanci
ann
miller
nmwandrewcmuedu
writes
god
truly
omnipotent
folks
like
claim
can't
terminate
eternity
reason
can't
flibble
glop
ork
groink
demanding
able
meaning
terms
classic
example
excessive
faith
reason
trouble
talking
doesn't
imply
impossible
simply
implies
hard
talk
chance
god
flibble
glop
ork
groink
charlie
wingate
flibble
glop
ork
groink
isn't
god
doug
graham
dgrahambnrca
opinions
liveseysolntzewpdsgicom
jon
livesey
writes
fun
debate
capital
punishment
wrong
group
only
relevance
here
don't
able
tell
capital
punishment
actually
murder
tell
murder
wrong
using
term
defined
well
i've
innocent
person
executed
objectively
murder
who
blame
question
entire
society
sanctions
sorts
executions
realizing
risksis
blame
probability
killing
innocent
person
shooting
random
air
probability
killing
innocent
person
state
administers
system
capital
punishment
know
actions
taking
sooner
later
result
killing
innocent
person
yes
probablity
kill
raondom
activity
presumably
isolated
totally
rest
society
driving
kill
people
airlines
people
continue
driving
flying
punishments
inflicted
unwilling
prisoners
courts
risks
take
willingly
argue
law
system
similar
risk
innocent
person
punished
someday
work
prevent
criminals
free
result
trying
prevent
punishment
innocents
driving
kills
sure
moral
issue
know
least
person
who
involved
fatal
accident
felt
vey
guilty
accidents
totally
expected
given
numner
vehicals
road
blame
society
i'm
saying
false
witness
resulted
innocent
person
convicted
killed
still
fault
state
actual
killing
just
commented
state
killing
depend
false
witnesses
state
killing
case
sincere
mistakes
yes
state
fault
case
state
only
prevent
false
witnesses
possible
trying
say
capital
punishment
murder
possibilty
human
error
invalidating
system
i'm
saying
capital
punishment
murder
period
involves
taking
human
life
that's
definition
murder
appeals
dictionaries
objective
morals
okay
call
murder
question
murders
wrong
saying
taking
human
life
wrong
matter
circumstances
society
decide
murder
say
lists
reasons
live
moral
consequences
play
word
games
pretend
murder
isn't
murder
that's
opinion
society
run
basically
works
society
accepts
risk
innocent
person
murdered
execution
member
society
shares
blame
people's
definitions
murder
include
sort
malicious
intent
involved
execution
trying
discuss
objective
moral
system
least
possibilty
ramifications
personal
system
objective
discussing
objective
moral
system
showing
didn't
incapable
defining
terms
example
murder
murder
violates
golden
rule
executions
allowing
society
implicitly
accepts
consequences
matter
who
innocent
victim
we're
talking
reading
minds
just
talking
knowing
truth
yes
absolutely
truth
court
systems
work
principle
knowing
truth
reasonable
doubt
sorry
simply
quoting
accurately
here
looking
totally
objectively
case
know
people
thinking
voting
execute
person
intent
malicious
unfair
execution
murder
now
slide
claim
jury
persuaded
doubt
knowing
minds
doubt
reading
minds
jury
certainly
tell
conviction
moral
objective
system
only
absolute
truth
matters
jury
system
method
approximate
truth
twelve
members
convinced
truth
jury
comes
sufficiently
prejudiced
background
may
allow
persuaded
doubt
evidence
laugh
read
minds
people
know
conviction
unfair
perfectly
fair
read
minds
assume
fair
knew
absolute
truth
fair
opinion
only
approximation
absolute
truth
it's
question
fairness
claim
quoted
claim
know
fair
able
distinguish
capital
punishnment
murder
yes
objectively
determine
difference
knew
possible
can't
determine
difference
flawed
system
think
system
possible
still
isn't
objectively
perfect
see
doesn't
matter
know
fair
objectively
fair
now
there's
huge
difference
read
minds
know
read
minds
know
difference
degree
fairness
know
know
effect
objective
system
think
possible
produce
fairly
objective
system
clear
goals
supposed
promote
i'm
going
waste
time
trying
devise
system
pretty
sure
exist
sure
simply
people
confront
reality
reality
remember
reality
important
case
reality
ideal
heories
know
fairness
justice
system
innocent
person
released
death
row
may
dozen
innocent
people
executed
hundred
simply
don't
know
assume
system
fairly
decent
least
likely
realize
correctness
system
says
totally
ideal
objective
system
now
going
hand
pretend
ideal
theory
know
know
justie
system
fair
wave
magic
wand
types
killing
murder
way
well
ideal
system
working
system
ideal
only
hope
create
system
close
approximation
ideal
system
possible
hand
recognize
justice
small
hope
probability
punishing
innocent
end
bear
moral
responsibility
probabilistic
consequences
systems
set
say
well
here
murdering
maybe
say
gee
wonder
strictly
yes
bear
responsibility
people
willing
think
second
preferable
requires
people
face
moral
consequences
society
sheltering
magic
ceremonies
word
games
realize
consequences
actions
keep
separating
justice
system
pack
forget
don't
think
objective
moral
system
believe
only
take
idea
seriously
presents
evidence
don't
think
country
objective
system
think
objective
system
exist
theory
omniscience
objective
system
possible
practice
keith
liveseysolntzewpdsgicom
jon
livesey
writes
now
comes
keith
schneider
says
here
objective
moral
system
start
ask
definitions
objective
system
depends
predictably
whole
falls
only
falls
attempt
apply
doesn't
mean
objective
system
can't
exist
just
means
implemented
keith
article
aakeplerunhedu
dmnkeplerunhedu
kings
philosophers
philosophers
kings
writes
recently
ras
ordered
resisted
cared
apparently
post
